const WAS_SERIF_DEFINE = {
  // 姫
  PRINCESS_OPENING: [
    "？？？「おはようございます。」",
    "？？？「目が覚めましたか？」",
    "？？？「私は先代魔王の娘、魔族の姫のようなものです。」",
    "姫「元々は魔王の力を少しだけ使えたのですが、あなたを助けるために魔王の力を渡してしまい、今はただの魔物となってしまいました。」",
    "姫「元人間のあなたにこんなことを頼むのもなんですが、私の代わりに新たな魔王になっていただけませんか？」",
    "姫「あなたならきっと、魔族の未来を良い方向に導いてくれると信じています。」",
    "姫「なぜ人間であるあなたを信じているのかって？」",
    "姫「それは今はまだ秘密です。」",
    "姫「とにかく、よろしくお願いします。」",
  ],
  PRINCESS_AFTER_OPENING1: [
    "姫「そういえば、これを渡しておくのを忘れていました。」",
    "魔王の魂を手に入れた！",
    "姫「それは亡き魔王の形見のようなものです。」",
    "姫「これがあれば、あなたを魔王と認めてくれる種族もいるかもしれません。」",
  ],
  PRINCESS_AFTER_OPENING2: [
    "姫「とりあえずは魔族の統一を目指しましょう。」",
    "姫「まずは近場の洞窟へ行き、ゴブリンたちのもとへ行ってください。」",
    "姫「洞窟を超えないと他の種族のもとにも行けないですからね。」",
  ],
  PRINCESS_AFTER_CAVE1: [
    "姫「見事ゴブリン一族を従えたようですね。」",
    "姫「すでにお気づきかもしれませんが、あなたは従えたゴブリンの力を使えるようになっています。」",
    "姫「魔王の力とは全ての魔族を統べる力。」",
    "姫「つまり、あなたは従えた魔族の力を使えるのです。」",
    "姫「この能力で、勇者率いる人間軍に一矢報いてください。」",
  ],
  PRINCESS_AFTER_CAVE2: [
    "姫「...ゴブリンを倒してしまったのですね。」",
    "姫「彼らを倒すことであなたの力は強くなったと思います。」",
    "姫「しかしそれでは、真の意味で彼らを従えたということにはなりません。」",
    "姫「今後は気を付けてください...。」",
  ],
  PRINCESS_AFTER_SEA1: [
    "姫「サハギンも悪い種族ではないのです。」",
    "姫「あれで海に選ばれた種族ですから...。」",
    "姫「穏便に済んで良かったです。」",
  ],
  PRINCESS_AFTER_SEA2: [
    "姫「クラーケンを倒したのですね...。」",
    "姫「機嫌が悪いせいで横暴な態度だったかもしれませんが、あれでも普段は友好的だったのですよ。」",
    "姫「一族によっては海を守る神と崇めていたとか...。」",
    "姫「強大な力は見方次第で恐怖にも安心にもなるのです。」",
  ],
  PRINCESS_AFTER_VILLAGE1: [
    "姫「エルフはどうでしたか？」",
    "姫「仲間をとても思いやった良い種族だったでしょう？」",
    "姫「魔族といえど、同じ命あるもの。」",
    "姫「その価値を人間が否定することを私は許せないのです。」",
  ],
  PRINCESS_AFTER_VILLAGE2: [
    "姫「エルフは何も悪いことはしていません。」",
    "姫「悪いのは暗黒化という現象。」",
    "姫「そして暗黒化の原因となった人間の所業...。」",
    "姫「どうか魔族が悪という考えはお捨てください...。」",
  ],
  PRINCESS_AFTER_MOUNTAIN1: [
    "姫「スライムもドラゴンも静かに暮らしたいだけなのです。」",
    "姫「スライムはとても愛らしく、ドラゴンはとても優しかったでしょう？」",
    "姫「魔族とは分かり合えればこんなにも素敵なのです。」",
  ],
  PRINCESS_AFTER_MOUNTAIN2: [
    "姫「なぜドラゴンを...。」",
    "姫「あなたも『人間』なのですね...。」",
    "姫「いえ、気にしないでください。」",
    "姫「選んだのは私ですから...。」",
  ],
  PRINCESS_BEFORE_LAST_AREA1: [
    "姫「多くの種族の従えた今、あなたは魔王と呼ぶにふさわしい存在になりました。」",
    "姫「今のあなたならきっと、勇者率いる人間軍を倒せるでしょう。」",
    "姫「どうか魔族を明るい未来へと導いてください！」",
  ],
  PRINCESS_BEFORE_LAST_AREA2: [
    "姫「多くの犠牲を経て、あなたは強くなりました。」",
    "姫「勇者率いる人間軍を倒し、魔族の未来を救ってください。」",
    "姫「どうか、この悲しい戦いを終わらせてください...。」",
  ],
  PRINCESS_WORST_END: [
    "姫「勇者はいなくなりましたが、魔族は皆おびえています。」",
    "姫「なぜか分かりますか？」",
    "姫「それは魔王であるあなたが、力によって世界を支配しているからです。」",
    "姫「かつてのあなたら、これがいかに愚かなことか分かってくれたでしょう。」",
    "姫「力もないのに魔族を助けようとした人間の頃のあなたなら...。」",
    "姫「人は力を手にすると変わってしまうものなのですね...。」",
    "姫「この世界に平和などありえないことだったのでしょうか...？」",
  ],
  PRINCESS_BAD_END: [
    "姫「よく勇者を倒してくれました。」",
    "姫「あなたを魔王に選んだのは間違いではありませんでした。」",
    "姫「頭を打ったせいであなたは忘れていると思いますが、あなたが私と初めて会った時、人間でありながら魔族である私を守ろうとしたんですよ？」",
    "姫「そんな優しさという強さを持つあなたら、きっと良い魔王になってくれると、私は信じていました。」",
    "姫「人間との争いはまだ続きそうですが、それも時間の問題。」",
    "姫「さあ、魔族の笑顔を取り戻しに行きましょう。」",
    "姫「あなたこそが世界を支配する魔王です！」",
  ],
  PRINCESS_GOOD_END: [
    "姫「...信じがたいですが、仕方ありません。」",
    "姫「あなたは人間で私は魔族。ただそれだけです。」",
    "姫「もし願いが一つ叶うのであれば、魔族である私を救ってくれた、あの頃のあなたに...。」",
    "姫「いえ、なんでもありません。」",
    "姫「これでさよならです。」",
  ],
  PRINCESS_BEST_END: [
    "姫「あなたには驚きました...。」",
    "姫「まさか魔族を平和に導くだけではなく、人間と魔族を仲を取り持ってくれるとは...。」",
    "姫「いえ、心の優しいあなたならきっとやってくれると、私自身どこかで願っていたのかもしれません。」",
    "姫「だからこそ、人間であるあなたを選んだのでしょう。」",
    "姫「素晴らしき人間、あなたがこの世界の魔王です！」",
  ],
  PRINCESS_HEAL: [
    "姫「長旅で疲れたでしょう？少しお休みください。」",
    "体力と満腹度が回復した！",
    "姫「少したくましくなりましたね。」",
    "姫「その調子で頑張ってください。」",
  ],
  // ゴブリン
  FACE_GOBLIN: [
    "ゴブリン「おめぇが新しい魔王？」",
    "ゴブリン「証明してみろ。」",
  ],
  BATTLE_WIN_GOBLIN: [
    "ゴブリン「やるでねぇか。」",
    "ゴブリン「ボス、あとは頼んました...。」",
  ],
  PERSUADE_SUCCESS_GOBLIN: [
    "ゴブリン「それは魔王の魂...！」",
    "ゴブリン「ボスのもとに連れてってやる。」",
    "ゴブリン「ボスはつえぇ奴が好きだ。」",
    "ゴブリン「おらの技、教えといてやる。」",
  ],
  // ボスゴブリン
  FACE1_BOSS_GOBLIN: [
    "ボスゴブリン「魔王の魂だと？」",
    "ボスゴブリン「力は本物なんじゃろうなぁ？」",
  ],
  FACE2_BOSS_GOBLIN: [
    "ボスゴブリン「うちの若いもんを可愛がってくれったらしいのぉ。」",
    "ボスゴブリン「どう落とし前付けるんじゃい！」",
  ],
  BATTLE_WIN_BOSS_GOBLIN: [
    "ボスゴブリン「つえぇなぁ。」",
    "ボスゴブリン「おめぇが魔王なら、魔族が復刻するかもしれねぇなぁ...。」",
  ],
  PERSUADE_SUCCESS_BOSS_GOBLIN: [
    "ボスゴブリン「魔族が復刻するのも近いもしれねぇなぁ。」",
    "ボスゴブリン「ゴブリン一族の力、貸してやる！」",
  ],
  CHAT_BOSS_GOBLIN: [
    "ボスゴブリン「ゴブリンの力は大地の力。」",
    "ボスゴブリン「魔王を名乗るならおらたちの力くらい使いこなしてみせろ。」",
  ],
  // エルフ
  FACE_ELF: [
    "エルフ「魔王がいなくなってから、暗黒化する者が出て困っています。」",
    "エルフ「何とかできる人はいないものでしょうか...。」",
  ],
  BATTLE_WIN_ELF: [
    "エルフ「その力、もしや新しい魔王...？」",
    "エルフ「しかし、あなたは力でしか支配できないようですね。」",
    "エルフ「仕方ありません...。」",
    "エルフ「横暴な魔王が君臨するくらいなら、暗黒化してでもあなたを止めます！」",
  ],
  PERSUADE_SUCCESS_ELF: [
    "エルフ「新たなる魔王、あなたがいれば暗黒化も落ち着くでしょう！」",
    "エルフ「あとはすでに暗黒化しててしまった者ですが...。」",
    "エルフ「何とかできませんか？」",
    "エルフ「代わりといってはなんですが、エルフの力をお貸しします。」",
  ],
  // ダークエルフ
  FACE1_DARK_ELF: [
    "ダークエルフ「人間も魔族も正義ではない。」",
    "ダークエルフ「力こそ正義。」",
    "ダークエルフ「人間に虐げられるくらいなら、悪魔にだって魂を売ってやるさ。」",
    "ダークエルフ「暗黒化したエルフの力、見せてやる！」",
  ],
  FACE2_DARK_ELF: ["ダークエルフ「暗黒化したエルフの力、味わいなさい！」"],
  BATTLE_WIN_DARK_ELF: [
    "ダークエルフ「止めてくれてありがとう。」",
    "ダークエルフ「魔族の未来に栄光あれ...！」",
  ],
  PERSUADE_SUCCESS_DARK_ELF: [
    "ダークエルフ「まさか元に戻れるなんて...。」",
    "ダークエルフ「ありがとうございます。」",
    "ダークエルフ「新しい魔王、あなたなら暗黒の力を使いこなせるでしょう。」",
  ],
  CHAT_DARK_ELF: ["ダークエルフ「見た目はともかく、中身は清いエルフですよ。」"],
  // サハギン
  FACE_SAHAGIN: [
    "サハギン「海だけの生活には飽きたんだぎゃ。」",
    "サハギン「陸上にも侵略してやるんだぎゃ！」",
  ],
  BATTLE_WIN_SAHAGIN: [
    "サハギン「陸上にはこんな強い奴がいるんだぎゃ...。」",
    "サハギン「だぎゃ、海にはもっと強い怪物が眠っているんだぎゃ...。」",
  ],
  PERSUADE_SUCCESS_SAHAGIN: [
    "サハギン「陸上にはこんなものがあるんだぎゃ！」",
    "サハギン「これがあれば海の怪物に一矢報いれるんだぎゃ！」",
    "サハギン「さっそく海底に急ぐんだぎゃ！」",
    "サハギン「あ、いいもんくれた礼におらたちの技を教えてやるんだぎゃ。」",
  ],
  // クラーケン
  FACE1_KRAKEN: [
    "魔王「（サハギンが海の怪物を呼び起こしてしまったようだ...。）」",
  ],
  FACE2_KRAKEN: ["魔王「（海の怪物が目を覚ましたようだ...。）」"],
  BATTLE_WIN_KRAKEN: ["魔王「（海の底に沈んでいった...。）」"],
  PERSUADE_SUCCESS_KRAKEN: [
    "魔王「（なんとなく頭を下げているように見える。）」",
    "魔王「（海の力を貸してくれるようだ。）」",
  ],
  CHAT_KRAKEN: [
    "魔王「（海の力について力説しているように見える。）」",
    "魔王「（なんとなくだけど...。）」",
  ],
  // スライム
  FACE_SLIME: ["魔王「（ぷるぷるしてる...。）」"],
  BATTLE_WIN_SLIME: ["魔王「（溶けちゃった...。）」"],
  PERSUADE_SUCCESS_SLIME: [
    "魔王「（小刻みにぷるぷるしてる...。）」",
    "魔王「（嬉しいのかな...？）」",
    "魔王「（...？）」",
    "魔王「（何か教えてくれているようだ。）」",
  ],
  // ドラゴン
  FACE1_DRAGON: [
    "ドラゴン「ぐぉぉお？」",
    "魔王「（「何しに来た？」と弱弱しく問かけているように聞こえる。）",
  ],
  FACE2_DRAGON: [
    "ドラゴン「ぐぉぉおおおお！！！」",
    "魔王「（「よくもスライムを！」と怒っているように聞こえる。）」",
  ],
  BATTLE_WIN_DRAGON: [
    "ドラゴン「ぐぉぉ...。」",
    "魔王「（「最強の種族である私が...。」と嘆いているように聞こえる）」",
  ],
  PERSUADE_SUCCESS_DRAGON: [
    "ドラゴン「ぐぉぉお！ぐぉぉおおお！」",
    "魔王「（「元気になった！お前に力を貸してやる！」と猛っているように聞こえる。）」",
  ],
  CHAT_DRAGON: [
    "ドラゴン「ぐぉぉおおおお！」",
    "魔王「（「最強と呼ばれる竜の炎、お前に貸してやる！」と自慢げに言っているように聞こえる。）」",
  ],
  // 兵士
  FACE_SOLDIER: [
    "兵士「魔王は倒したんだから、無駄な討伐など控えれば良いのに...。」",
    "兵士「いくら魔族といえど、もうあの悲鳴は聞きたくないな...。」",
    "兵士「まったく、今の勇者様は何を考えてるか分からないな。」",
    "兵士「おっと、今のは聞かなかったことにしてくれ。」",
    "兵士「勇者様に意見しようものなら命が危ういからね。」",
  ],
  BATTLE_WIN_SOLDIER: [
    "兵士「人間でありながら悪しき魔族の肩を持つとは...。」",
    "兵士「やはり、魔族は根絶するべきだ...！」",
    "兵士「貴様も勇者様の手で散ってしまえ...。」",
  ],
  PERSUADE_SUCCESS_SOLDIER: [
    "兵士「それは魔族の魂！」",
    "兵士「しかも、相当強い魔族なんじゃないか？」",
    "兵士「もしその魔族を倒したんだとしたら、お前相当強いな...。」",
    "兵士「それだけの力があれば勇者様にも意見できるんじゃないか？」",
    "兵士「頼むよ、無駄な戦いは控えるように勇者様に伝えてくれ。」",
    "兵士「もう人間の悲鳴も、魔族の悲鳴も聞きたくないんだ。」",
  ],
  // 勇者
  FACE1_HERO: [
    "勇者「お前、強いみたいだな。」",
    "勇者「無駄な戦いは控えろって？」",
    "勇者「それは無理だな。」",
    "勇者「だって魔族を狩るのって楽しいじゃん。」",
    "勇者「あいつらすげえいい声で泣くんだぜ！」",
  ],
  FACE2_HERO: [
    "勇者「お前からは魔王の力を感じる...。」",
    "勇者「わざわざ敵地に来るなんて、今度の魔王はずいぶん間抜けだな。」",
    "勇者「せいぜい俺を楽しませてくれよ？」",
  ],
  BATTLE_WIN_HERO: [
    "勇者「ばかな...。」",
    "勇者「この俺が負けるなんて...。」",
    "勇者「それだけ強いんだ、その力で世界を支配するんだろう？」",
    "勇者「力あるものなら皆そうするさ。」",
    "勇者「きっとお前も同じはずだ。」",
  ],
  PERSUADE_SUCCESS_HERO: [
    "勇者「お前も魔族狩りが好きなんだな！」",
    "勇者「どうやら次の魔王は雌らしいぜ。」",
    "勇者「きっといい声で泣くんだろうなぁ...。」",
    "勇者「一緒に狩りに行くぞ！」",
  ],
};

export default WAS_SERIF_DEFINE;
