const WAS_SERIF_DEFINE = {
  // 姫
  PRINCESS_OPENING: [
    "おはようございます。",
    "目が覚めましたか？",
    "私は先代魔王の娘。",
    "ですが、あなたに魔王の力を渡したことで今は魔物になってしまいました。",
    "元人間のあなたにこんなことを頼むのもなんですが、私の代わりに新たな魔王になっていただけませんか？",
    "...まあこれは質問ではなく、半ば命令なのですが。",
    "とにかく、よろしくお願いします。",
  ],
  PRINCESS_AFTER_OPENING: [
    "とりあえずは魔族の統一を目指しましょう。",
    "まずは近場の洞窟へ行き、ゴブリンたちのもとへ行ってください。",
    "洞窟を超えないと他の種族のもとにも行けないですからね。",
  ],
  PRINCESS_AFTER_CAVE1: [
    "見事ゴブリン一族を従えたようですね。",
    "すでにお気づきかもしれませんが、あなたは従えたゴブリンの力を使えるようになっています。",
    "魔王の力とは全ての魔族を統べる力。",
    "つまり、あなたは従えた魔族の力を使えるのです。",
    "この能力で、勇者率いる人間軍に一矢報いてください。",
  ],
  PRINCESS_AFTER_CAVE2: [
    "...ゴブリンを倒してしまったのですね。",
    "彼らを倒すことであなたの力は強くなったと思います。",
    "しかしそれでは、真の意味で彼らを従えたということにはなりません。",
    "今後は気を付けてください...。",
  ],
  PRINCESS_AFTER_SEA1: [
    "サハギンも悪い種族ではないのです。",
    "あれで海に選ばれた種族ですから...。",
    "穏便に済んで良かったです。",
  ],
  PRINCESS_AFTER_SEA2: [
    "クラーケンを倒したのですね...。",
    "機嫌が悪いせいで横暴な態度だったかもしれませんが、あれでも普段は友好的だったのですよ。",
    "一族によっては海を守る神と崇めていたとか...。",
    "強大な力は見方次第で恐怖にも安心にもなるのです。",
  ],
  PRINCESS_AFTER_VILLAGE1: [
    "エルフはどうでしたか？",
    "仲間をとても思いやった良い種族だったでしょう？",
    "魔族といえど、同じ命あるもの。",
    "その価値を人間が否定することを私は許せないのです。",
  ],
  PRINCESS_AFTER_VILLAGE2: [
    "エルフは何も悪いことはしていません。",
    "悪いのは暗黒化という現象。",
    "そして暗黒化の原因となった人間の所業...。",
    "どうか魔族が悪という考えはお捨てください...。",
  ],
  PRINCESS_AFTER_MOUNTAIN1: [
    "スライムもドラゴンも静かに暮らしたいだけなのです。",
    "スライムはとても愛らしく、ドラゴンはとても優しかったでしょう？",
    "魔族とは分かり合えればこんなにも素敵なのです。",
  ],
  PRINCESS_AFTER_MOUNTAIN2: [
    "なぜドラゴンを...。",
    "あなたも「人間」なのですね...。",
    "いえ、気にしないでください。",
    "選んだのは私ですから...。",
  ],
  PRINCESS_BEFORE_LAST_AREA1: [
    "他種族の力を得た今、あなたは魔王と呼ぶにふさわしい存在になりました。",
    "今のあなたならきっと、勇者率いる人間軍を倒せるでしょう。",
    "どうか魔族を明るい未来へと導いてください。",
  ],
  PRINCESS_BEFORE_LAST_AREA2: [
    "多くの犠牲を経て、あなたは強くなりました。",
    "どうか、この悲しい戦いを",
    "勇者率いる人間軍を倒し、魔族の未来を救ってください！",
  ],
  PRINCESS_WORST_END: [
    "勇者はいなくなりましたが、魔族は皆おびえています。",
    "なぜか分かりますか？",
    "それは魔王であるあなたが、力によって世界を支配しているからです。",
    "かつてのあなたらこれがいかに愚かなことか分かってくれたでしょう。",
    "力もないのに魔族を助けようとした人間の頃のあなたなら...。",
    "人は力を手にすると変わってしまうものなんですね...。",
    "この世界に平和などありえないことだったのでしょうか...？",
  ],
  PRINCESS_BAD_END: [
    "よく勇者を倒してくれました。",
    "あなたを魔王に選んだのは間違いではありませんでした。",
    "頭を打ったせいであなたは忘れていると思いますが、あなたが私と初めて会った時、人間でありながら魔族である私を守ろうとしたんですよ？",
    "そんな優しさという強さを持つあなたら、きっと良い魔王になってくれると、私は信じていました。",
    "人間との争いはまだ続きそうですが、それも時間の問題。",
    "さあ、魔族の笑顔を取り戻しに行きましょう。",
    "あなたこそが世界を支配する魔王です！",
  ],
  PRINCESS_GOOD_END: [
    "...信じがたいですが、仕方ありません。",
    "あなたは人間で私は魔族。ただそれだけです。",
    "もし願いが一つ叶うのであれば、魔族である私を救ってくれた、あの頃のあなたに...。",
    "いえ、なんでもありません。",
    "これでさよならです。",
  ],
  PRINCESS_BEST_END: [
    "あなたには驚きました...。",
    "まさか魔族を平和に導くだけではなく、人間と魔族を仲を取り持ってくれるとは...。",
    "いえ、心の優しいあなたならきっとやってくれると、私自身どこかで願っていたのかもしれません。",
    "だからこそ、人間であるあなたを選んだのでしょう。",
    "素晴らしき人間、あなたがこの世界の魔王です！",
  ],
  // ゴブリン
  FACE_GOBLIN: ["おめぇが新しい魔王？", "証明してみろ。"],
  BATTLE_WIN_GOBLIN: ["やるでねぇか。", "ボス、あとは頼んました...。"],
  PERSUADE_SUCCESS_GOBLIN: [
    "それは魔王の魂...！",
    "ボスのもとに連れてってやる。",
  ],
  // ボスゴブリン
  FACE1_BOSS_GOBLIN: ["魔王の魂だと？", "力は本物なんじゃろうなぁ？"],
  FACE2_BOSS_GOBLIN: [
    "うちの若いもんを可愛がってくれったらしいのぉ。",
    "どう落とし前付けるんじゃい！",
  ],
  BATTLE_WIN_BOSS_GOBLIN: ["つえぇなぁ。", "おめぇが魔王なら...。"],
  PERSUADE_SUCCESS_BOSS_GOBLIN: [
    "魔族が復刻するのも近いもしれねぇなぁ。",
    "ゴブリン一族の力、貸してやる。",
  ],
  CHAT_BOSS_GOBLIN: [
    "ゴブリンの力は大地の力。",
    "魔王を名乗るならおらたちの力くらい使いこなしてみせろ。",
  ],
  // エルフ
  FACE_ELF: [
    "魔王がいなくなってから、暗黒化する者が出て困っています。",
    "何とかできませんか？",
  ],
  BATTLE_WIN_ELF: [
    "所詮力でしか支配できないのですか。",
    "ならば仕方ありません...。",
  ],
  PERSUADE_SUCCESS_ELF: [
    "新たなる魔王、あなたがいれば暗黒化も落ち着くでしょう！",
    "あとはすでに暗黒化しててしまった者ですが...。",
    "何とかできませんか？",
    "代わりといってはなんですが、エルフの力をお貸しします。",
  ],
  // ダークエルフ
  FACE1_DARK_ELF: [
    "人間も魔族も正義ではない。",
    "力こそ正義。",
    "人間に虐げられるくらいなら悪魔にだって魂を売ってやるさ。",
    "暗黒化したエルフの力、見せてやる！",
  ],
  FACE2_DARK_ELF: ["暗黒化したエルフの力、味わいなさい！"],
  BATTLE_WIN_DARK_ELF: [
    "本当はどこかで止まりたかったのです...。",
    "ありがとう。",
    "魔族の未来に栄光あれ...！",
  ],
  PERSUADE_SUCCESS_DARK_ELF: [
    "まさか元に戻れるなんて...。",
    "ありがとうございます。",
    "新しい魔王、あなたなら暗黒化でさえも使いこなせるでしょう。",
  ],
  CHAT_DARK_ELF: ["見た目はともかく、中身は清いエルフですよ。"],
  // サハギン
  FACE_SAHAGIN: ["海の支配は終わった。", "次は陸上だぎゃ！"],
  BATTLE_WIN_SAHAGIN: [
    "陸上にはこんな強い奴がいるんだぎゃ...。",
    "だぎゃ海にはもっと強い怪物が眠っているんだぎゃ...。",
  ],
  PERSUADE_SUCCESS_SAHAGIN: [
    "陸上にはこんなものがあるんだぎゃ！",
    "海もまだまだ開拓の余地があるんだぎゃ！",
    "さっそく海底に急ぐんだぎゃ！",
  ],
  // クラーケン
  FACE1_KRAKEN: ["（サハギンが海の怪物を呼び起こしてしまったようだ...。）"],
  FACE2_KRAKEN: ["（海の怪物が目を覚ましたようだ...。）"],
  BATTLE_WIN_KRAKEN: ["（海の底に沈んでいった...。）"],
  PERSUADE_SUCCESS_KRAKEN: [
    "（なんとなく頭を下げているように見える。）",
    "（海の力を貸してくれるようだ。）",
  ],
  CHAT_KRAKEN: [
    "（海の力について力説しているように見える。）",
    "（なんとなくだけど...。）",
  ],
  // スライム
  FACE_SLIME: ["（ぷるぷるしてる...。）"],
  BATTLE_WIN_SLIME: ["（溶けちゃった...。）"],
  PERSUADE_SUCCESS_SLIME: [
    "（小刻みにぷるぷるしてる...。）",
    "（嬉しいのかな...？）",
  ],
  // ドラゴン
  FACE1_DRAGON: [
    "ぐぉぉお？",
    "（「何しに来た？」と弱弱しく問かけているように聞こえる。）",
  ],
  FACE2_DRAGON: [
    "ぐぉぉおおおお！！！",
    "（「よくもスライムを！」）と怒っているように聞こえる。）",
  ],
  BATTLE_WIN_DRAGON: [
    "ぐぉぉ...",
    "（「最強の種族である私が...」と嘆いているように聞こえる）",
  ],
  PERSUADE_SUCCESS_DRAGON: [
    "ぐぉぉお！ぐぉぉおおお！",
    "（「元気になった！お前に力を貸してやる！」と猛っているように聞こえる。）",
  ],
  CHAT_DRAGON: [
    "ぐぉぉおおおお！",
    "（「最強と呼ばれる竜の炎、お前に貸してやる！」と自慢げに言っているように聞こえる。）",
  ],
  // 兵士
  FACE_SOLDIER: [
    "魔王は倒したんだから、無駄な討伐など控えれば良いのに...。",
    "いくら魔族といえど、もうあの悲鳴は聞きたくないな...。",
    "まったく、今の勇者様は何を考えてるか分からないな。",
    "おっと、今のは聞かなかったことにしてくれ。",
    "勇者様に意見しようものなら命が危ういからね。",
  ],
  BATTLE_WIN_SOLDIER: [
    "人間でありながら悪しき魔族の肩を持つとは...。",
    "やはり、魔族は根絶するべきだ...！",
    "貴様も勇者様の手で散ってしまえ...。",
  ],
  PERSUADE_SUCCESS_SOLDIER: [
    "それは魔族の魂！",
    "しかも、相当強い魔族なんじゃないか？",
    "もしその魔族を倒したんだとしたら、お前相当強いな...。",
    "それだけの力があれば勇者様にも意見できるんじゃないか？",
    "頼むよ、無駄な戦いは控えるように勇者様に伝えてくれ。",
    "もう人間の悲鳴も、魔族の悲鳴も聞きたくないんだ。",
  ],
  // 勇者
  FACE1_HERO: [
    "お前、強いみたいだな。",
    "無駄な戦いは控えろって？",
    "それは無理だな。",
    "だって魔族を狩るのって楽しいじゃん。",
    "あいつらすげえいい声で泣くんだぜ！",
  ],
  FACE2_HERO: [
    "お前からは魔王の力を感じる...。",
    "わざわざ敵地に来るなんて、今度の魔王はずいぶん間抜けだな。",
    "せいぜい俺を楽しませてくれよ？",
  ],
  BATTLE_WIN_HERO: [
    "ばかな...。",
    "この俺が負けるなんて...。",
    "お前が新しい魔王？",
    "新しい魔王は雌だと聞いていたが...。",
    "いや、この強さなら納得だ...。",
    "その力で世界を支配するんだろう？",
    "力あるものなら皆そうするさ。",
    "きっとお前も同じはずだ。",
  ],
  PERSUADE_SUCCESS_HERO: [
    "お前も魔族狩りが好きなんだな！",
    "どうやら次の魔王は雌らしいぜ。",
    "きっといい声で泣くんだろうなぁ...。",
    "一緒に狩りに行くぞ！",
  ],
};

export default WAS_SERIF_DEFINE;
