const TBH_MESSAGES = {
    OPENING_01: "俺はヒーロー志望のフリーター！\n立派なヒーローなるために頑張るぞ！",
    BAD_END_00: "あなたは普通の人！",
    BAD_END_01: "金もなければ命もない",
    BAD_END_02: "生きる価値なし！",
    BAD_END_03: "筋肉はお前を助けない",
    BAD_END_04: "立派なコレクター人生でしたね",
    HAPPY_END_01: "ヨッ！喧嘩番長！",
    HAPPY_END_02: "こうして世界は救われたとさ",
    TRUE_END_01: "あんまりうろうろしないでください！徘徊おじさん！",
    TRUE_END_02: "筋トレしすぎ！筋肉ダルマさん！",
    TRUE_END_03: "バイトのために生きてるんですね！金の亡者さん！",
    TRUE_END_04: "買い物大好きなんですね！プロショッパーさん！",
    TRUE_END_05: "たまには動きましょうよ。ニートさん...",
  };
  
  export default TBH_MESSAGES;
  